In [2]:
import pandas as pd
import numpy as np
string_data = pd.Series(["a","b",np.nan,"d"])
string_data.isnull() # isnull()을 이용해 nan 데이터 찾기

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna() #dropna()를 이용해 빈칸 생략

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])
cleaned_data1 = data.dropna()
cleaned_data1
cleaned_data2 = data.dropna(how='all')
cleaned_data2

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data2 = pd.DataFrame(np.random.randn(7, 3))
data2.iloc[:4, 1] = NA
data2.iloc[:2, 2] = NA
data2

          0         1         2
0 -0.852639       NaN       NaN
1  0.880766       NaN       NaN
2  1.042960       NaN  2.009640
3  0.053136       NaN -0.555036
4  1.055343 -0.322618  0.474085
5 -0.370519  0.189947 -0.722930
6  1.279326  0.106150 -0.330608

In [10]:
data2.dropna() # NaN값 제외

          0         1         2
4  1.055343 -0.322618  0.474085
5 -0.370519  0.189947 -0.722930
6  1.279326  0.106150 -0.330608

In [11]:
data2.dropna(thresh=2) #thresh=2 NA=2개 값 제외 후 출력

          0         1         2
2  1.042960       NaN  2.009640
3  0.053136       NaN -0.555036
4  1.055343 -0.322618  0.474085
5 -0.370519  0.189947 -0.722930
6  1.279326  0.106150 -0.330608

In [14]:
data2 = data2.fillna(0) # nan값 채우기
data2

          0         1         2
0 -0.852639  0.000000  0.000000
1  0.880766  0.000000  0.000000
2  1.042960  0.000000  2.009640
3  0.053136  0.000000 -0.555036
4  1.055343 -0.322618  0.474085
5 -0.370519  0.189947 -0.722930
6  1.279326  0.106150 -0.330608

In [16]:
data2.fillna(0, inplace=True)
data2

          0         1         2
0 -0.852639  0.000000  0.000000
1  0.880766  0.000000  0.000000
2  1.042960  0.000000  2.009640
3  0.053136  0.000000 -0.555036
4  1.055343 -0.322618  0.474085
5 -0.370519  0.189947 -0.722930
6  1.279326  0.106150 -0.330608

In [17]:
dic_data = {"k1":['one','two','one','two','one','two','two'],
           "k2":[1, 1, 2, 3, 3, 4, 4]}
data = pd.DataFrame(dic_data)
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [18]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [19]:
data.drop_duplicates() #drop을 이용한 중복값 제거

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [21]:
data['v1'] = [0, 1, 2, 3, 4, 5, 6]
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [22]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [23]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [24]:
bins = [18,25,36,60,100]

In [25]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 36], (18, 25], ..., (25, 36], (60, 100], (36, 60], (36, 60], (25, 36]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 36] < (36, 60] < (60, 100]]

In [26]:
pd.value_counts(cats)

(18, 25]     5
(25, 36]     3
(36, 60]     3
(60, 100]    1
dtype: int64

In [27]:
import re

In [28]:
text = "foo bar\t baz \tqux"

In [29]:
re.split('\s+', text) # 탭 넣지 마세요의 기능 '\s+'

['foo', 'bar', 'baz', 'qux']

In [33]:
text = """Dave dave@google.com
Steve steve@google.com
Ryan ryan@yahoo.com
Rob rob@gmail.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+.[A-Z]{2,4}'
re1 = re.compile(pattern, flags=re.IGNORECASE)

In [34]:
re1.findall(text)

['dave@google.com', 'steve@google.com', 'ryan@yahoo.com', 'rob@gmail.com']

In [35]:
data = pd.Series(np.random.randn(9),
                index=['a','a','a','b','b','c','c','d','d'])
data

a   -0.592271
a    0.116713
a    0.970776
b   -0.357555
b   -0.170485
c   -0.246569
c    1.450241
d    0.497864
d   -0.030450
dtype: float64

In [36]:
data = pd.Series(np.random.randn(9),
                index=[['a','a','a','b','b','c','c','d','d'],
                        [1,  2,  3,  1,  2,  1,  2,  1,  2]])

data

a  1    2.250358
   2   -1.271754
   3   -0.112180
b  1    1.733943
   2   -1.759726
c  1   -0.694758
   2   -0.909135
d  1   -1.619645
   2    1.448331
dtype: float64

In [37]:
data['b'] # b데이터 값만 꺼내오기

1    1.733943
2   -1.759726
dtype: float64

In [38]:
data.loc[['b','d']] #b, d 데이터 값 꺼내오기

b  1    1.733943
   2   -1.759726
d  1   -1.619645
   2    1.448331
dtype: float64

In [39]:
data.loc[:,2] # 각 항목의 2번째 열의 데이터값 꺼내기

a   -1.271754
b   -1.759726
c   -0.909135
d    1.448331
dtype: float64

In [44]:
# 데이터 합치기
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1':[0,1,2,3,4,5,6]})
df2 = pd.DataFrame({'key':['a','b','d'],'data2':range(3)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [45]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [49]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [50]:
df3 = pd.DataFrame({'l_key':['b','b','a','c','a','a','b'],'data1':[0,1,2,3,4,5,6]})
df4 = pd.DataFrame({'r_key':['a','b','d'],'data2':range(3)})

In [51]:
pd.merge(df3,df4,left_on='l_key',right_on='r_key')

  l_key  data1 r_key  data2
0     b      0     b      1
1     b      1     b      1
2     b      6     b      1
3     a      2     a      0
4     a      4     a      0
5     a      5     a      0

In [54]:
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [56]:
np.concatenate([arr, arr], axis=1) # axis= 1,열방향/2,행방향

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [57]:
s1 = pd.Series([0,1], index=["a","b"])
s2 = pd.Series([2,3,4], index=["c","d","e"])
s3 = pd.Series([5,6], index=["f","g"])
print(s1);print(s2);print(s3)

a    0
b    1
dtype: int64
c    2
d    3
e    4
dtype: int64
f    5
g    6
dtype: int64

In [58]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0